import MenuBar from "../components/MenuBar";
import "./About.css";
import enterImg from './about_images/enter.PNG';
import menuImg from './about_images/menu.PNG';
import menuImg2 from './about_images/menu2.PNG';
import selectImg from './about_images/select.PNG';
import mychatsImg from './about_images/mychats.PNG';
import rulesImg from './about_images/chat_rules.PNG';
import chatImg from './about_images/chat.PNG';

function About() {

  return (
    <>
      <MenuBar />
      <div className="help-container">
          <h1 className="page-title">راهنمای جامع شرکت در مسابقه</h1>
          <div class="nav">
            <a href="#goal" class="nav-elem">هدف</a>
            <a href="#generalProc" class="nav-elem">روند کلی مسابقه</a>
            <a href="#rules" class="nav-elem">قوانین چت</a>
            <a href="#scoring" class="nav-elem">نحوۀ امتیازدهی</a>
            <a href="#attending" class="nav-elem">نحوۀ شرکت</a>
          </div>
          <div class="section">
            <h2 className="sub-title" id="goal">هدف</h2>
            <p>
            این مسابقه سعی دارد تا در بستر یک رقابت سرگرم‌کننده به همراه جایزه، امکان جمع‌آوری داده برای یک پروژه علمی در زمینه پردازش زبان طبیعی را فراهم کند که در صورت رعایت اصولی ساده، این داده‌ها می‌توانند هم بسیار کمک‌کننده و ارزشند باشند و هم منجر به دریافت جایزه شوند.
            </p>
            <p>
            هدف ما، طراحی چنین رباتی است که همانند شما و یا نفر کناریتان، اگر سر صحبت را باز کرد و یا با آن گفتگویی صورت گرفت، در حین چت اطلاعات طرف مقابل را برای ارائه خدمات بعدی استخراج و ذخیره کند. 
            </p>
            <p>
            طبیعتا در ضمن چنین گفتگوهایی حتی با یک انسان، اگر مدام از شما سوال شود که مثلا «شما چند سال دارید؟»، «نگفتید شغلتان چیست؟»، «راستی شغل پدرتان را هم بگویید» حس بازجویی یا استنتاق بهتان دست می‌دهد و تمایل زیادی به ادامه صحبت ندارید. شاید حتی با خود بگویید او برای چه مرتبا با این سوالها وارد حریم خصوصی من می‌شود. بنابراین کسب این اطلاعات با طرح حداقل سوال مستقیم مطلوب‌ترین حالت پیشبرد مکالمه است ودر امتیاز شما نیز موثر است. شما باید به نحوی مخاطبتان را ترغیب به بیان اطلاعاتی از خودش کنید. 
            </p>
            <p>
            هنر خود را در جذب مخاطب و به اصطلاح حرف از زیر زبان او کشیدن اینجا نشان دهید و یا تمرین کنید! 😉
            </p>
            <p>
            این ویژگی خصوصیت بدی هم نیست، باور کنید 😁
            </p>
          </div>
          <div class="section">
            <h2 className="sub-title" id="generalProc">روند کلی مسابقه</h2>
            <p>
            در این مسابقه، شما وارد یک سامانه چت می‌شوید که در هر چت یا گفتگو، پروفایلی از اطلاعات شخصی بصورت تصادفی به شما تخصیص داده می‌شود؛ اگر خواستید اطلاعاتی از خود بیان کنید باید بر طبق همین پروفایل باشد. تمام سعی شما هم در ضمن چت این است که حدس بزنید پروفایل شخص مقابلتان چیست. 
            </p>
          </div>
          <div class="section">
            <h2 className="sub-title" id="rules">قوانین چت</h2>
            <p>
            این قوانین در هنگام ورود به هر چت نیز نمایش داده می‌شوند:
            </p>
            <ol>
              <li>
              پاسختان به سوالات شخصی که در چت از شما می‌شود باید بر اساس اطلاعات تخصیص داده شده در پروفایلتان باشد.
              </li>
              <li>
             	سعی کنید پروفایل مخاطب خود را حدس بزنید. هر چه این تخمین به پروفایل واقعی او نزدیکتر باشد امتیاز بیشتری می‌گیرید. حدستان باید در فرم پروفایل مخاطب وارد شود.
              </li>
              <li>
              در ابتدای چت و پایان آن نیازی به ردوبدل کردن پیامهای احوال‌پرسی و خداحافظی نیست، در صورت لزوم به یک پیام بسنده کنید.
              </li>
              <li>
              تا حد ممکن از پرسیدن سوالات مستقیم پرهیز کنید.
              </li>
              <li>
              شما می‌توانید حداکثر ۲۷ پیام به طرف مقابل ارسال کنید.
              </li>
              <li>
              حدّاقل باید ۴ پیام از طرف شما در چت موجود باشد.
              </li>
              <li>
              پیامتان حاوی کلمات نامناسب نباشد. در صورت وجود، پیام خطایی صادر شده و از ارسال آن جلوگیری می‌شود.
              </li>
              <li>
              هر پیام حدّاقل ۲ کلمه و حدّاکثر ۲۸ کلمه باشد.
              </li>
              <li>
              پیام متنوع و با معنی باشد.
              </li>
              <li>
              پیامها فارسی باشند و اصطلاحاً فینگلیش نباشند.
              </li>
              <li>
              پیام‌های شما و مخاطبتان یکی در میان باشد.
              </li>
            </ol>
          </div>
          <div class="section">
            <h2 className="sub-title" id="scoring">نحوۀ امتیازدهی</h2>
            <p>
            سه عامل در امتیازدهی موثر هستند:
            </p>
            <ul>
              <li>
              طرح حداقل سوال مستقیم از کاربر. مثلا دو گفتۀ زیر را برای پر کردن آیتم «محل سکونت» در پروفایل مخاطب را در نظر بگیرید:
            <ol>
              <li>
              «راستی مایل بودید تشریف بیارید شهر ما تهران، اگر هم بفرمایین کدوم شهر ساکنید امسال عید که برای سفر اومدیم ممکن هست از کنارتان گذر کنیم، آن وقت می‌توانیم بیاییم عرض ادبی بکنیم»
              </li>
              <li>
              «شما ساکن کجا هستید؟»
              </li>
            </ol>
            گفتۀ 1 که غیرمستقیم سوال پرسیده امتیاز بیشتری می‌گیرد.
              </li>
              <li>
              پر کردن بیشترین میزان از اطلاعات درست در پروفایل مخاطب  
              </li>
              <li>
              رسیدن به اطلاعات حداکثری از پروفایل با رد و بدل کردن پیام کمتر. طبیعتا شرکت‌کننده‌ای که بتواند با پیامهای کمتری (با ترغیب مخاطب) نسبت به سایر رقبایش همان حجم اطلاعات را استخراج کند برتر از بقیه بوده و امتیاز بیشتر می‌گیرد. 
              </li>
            </ul>
          </div>
          <div class="section">
            <h2 className="sub-title" id="attending">نحوۀ شرکت در مسابقه</h2>
            <p>
            1. در صفحۀ ورودی سایت، اطلاعات اولیه و پایه‌ای از هدف و روند مسابقه ارائه داده شده است. 
            </p>
            <p>
            با کلیک بر روی دکمه «شرکت در مسابقه» وارد فضای اصلی مسابقه خواهید شد:
            </p>
            <img className="inside-img" src={enterImg}/>
            <p>
            2. در این محیط، با انتخاب تب «ثبت‌نام» در منوی بالای صفحه، ثبت‌نام کرده و خودکار وارد سیستم شوید:
            </p>
            <img className="inside-img" src={menuImg}/>
            <p>
            پس از ورود، ظاهر صفحه به شکل زیر تغییر می‌کند:
            </p>
            <img className="inside-img" src={menuImg2}/>
            <p>
            حال می‌توانید از کشوی Username، نام کاربری دیگری را که مایل به چت با او هستید انتخاب و پس از فشردن دکمه «چت» با او وارد گفتگو شوید.
            </p>
            <p>
            اگر هم پیش از این با شخصی وارد گفتگو شده‌اید می‌توانید با رفتن به تب «چت‌های من»، لیستی از مکالمات قبلی را دیده و هر کدام را که مایل به ادامه هستید انتخاب کنید تا از همانجایی که گفتگو قطع شده، روند را از سر بگیرید.
            </p>
            <p>
            دقت کنید که در هنگام انتخاب نام کاربری از لیست کشویی، دایره سبزرنگ در کنار نام فرد نشانگر برخط بودن او و دایره سفید نشان آفلاین بودن است که در این صورت، هر زمان آنلاین شد پاسخ پیام ارسالی شما را خواهد داد:
            </p>
            <img className="inside-img" src={selectImg}/>
            <p>
            در تب «چت‌های من» نیز دایره سفید و سبز به همین معنا هستند:
            </p>
            <img className="inside-img" src={mychatsImg}/>
            <p>
            به علاوه، آخرین پیام رد و بدل شده در باکسِ هر چت به همراه تاریخ ارسال نشان داده می‌شود. چت‌ها بر اساس آخرین گفتگوی صورت گرفته مرتب شده‌اند و در هر گفتگو هم اگر نوبت ارسال پیام شما باشد یک نشانگر «چیزی بگو» در کنار آن ظاهر می‌شود. 
            </p>
            <p>
            3. در صفحۀ اصلی گفتگو، ابتدا قوانین چت نمایش داده می‌شود:
            </p>
            <img className="inside-img" src={rulesImg}/>
            <p>
            در این صفحه دو پروفایل یکی در سمت چپ با عنوان «پروفایل شما» و یکی در سمت راست با عنوان «پروفایل مخاطب» نمایش داده شده است که در قالب فرم بوده و شما باید آن را پر کنید:
            </p>
            <img className="inside-img" src={chatImg}/>
            <p>
            پروفایل شما مجموعه‌ای از اطلاعات شخصیِ تخصیص داده به شما است همانند نام، سن یا شغل که چتتان باید بر اساس این اطلاعات باشد. برای مثال اگر در ضمن چت درباره اسم یا سنتان صحبتی به میان آمد باید نام یا عدد سنی که در پروفایل نوشته شده را بیان کنید. همچنین اگر از سوی دیگر، بطور مستقیم یا غیر مستقیم از اطلاعات مخاطب خود آگاه شدید باید آن را در فرم پروفایل مخاطب وارد کنید و دکمه ثبت پروفایل را بزنید تا نتیجه، ثبت شود و بازخورد متناسب از سوی سیستم بهتان داده شود. دقت کنید که دکمه ثبت پروفایل را در ضمن چت، هر زمان که حتی بخشی از داده مخاطب را هم وارد کردید می‌توانید بفشارید و کلیک چند باره بر روی آن در زمان‌های مختلف از گفتگو مانعی ندارد.  
            </p>
          </div>
      </div>
    </>
  );
}

export default About;
